# clients=["Muntasir", "Kuma", "Edzen", "Faha" ]
# print(clients[::-1])


# lst=[True, "Hello", 10, 1.5,[True, 10,10]]
# print(lst[1][::-1])


# cars=["Lexus", "Mersedes", "BMW", "AUDI"]
# mers= cars[1]

# del cars[1:3]
# print(mers)

# it_com=["IT ACADEMI", "IT RUN",]
# it_com.append("Megacom it")
# it_com.insert(1,"FIRST company")
# it_com[2]="HELLO"
# print(it_com)




# countries=["Austria", "Germany", "USA"]
# countries.sort()

# countries.reverse()
# print(countries)
# # print(countries.index("Germany"))

# # countries.pop(2)

# num=[1,10,100,2,3,5,88,466]
# num.sort()
# num.reverse()


price =[10,100,1,0.1,122,34,44]
print(min(price))
print(max(price))
print(sum(price))
print(len(price))
print(sum(price)/ len(price))


# Создайте плейлист из 10 любимых песен, поменяйте 4-й с 8-м и выведите на экран весь плейлист

# Создайте список из 15 элементов. Сделайте срез от 2-го индекса до 7-го

# Создайте список чисел и выведите их в обратном порядке

# Даны два списка, удалите все элементы первого списка из второго
# a = [1, 3, 4, 5] 
# b = [4, 5, 6, 7]

# Найдите наименьший элемент в списке из задания 5
# Удалите все элементы из списка, созданного в задании 5

# Найдите сумму элементов списка из задания 5
# Найдите среднее арифметическое элементов списка из задания 5











# del num

a=[1,3,4,5]
b=[4,5,6,7]
c = a+b
print(list(set(c)))


a=[1,3,4,5]
b=[4,5,6,7]












